# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Shell extension to jump to frequently used directories
brew "autojump"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Load/unload environment variables based on $PWD
brew "direnv"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# GNU grep, egrep and fgrep
brew "grep"
# Improved top (interactive process viewer)
brew "htop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Platform built on V8 to build network applications
brew "node"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Terminal multiplexer
brew "tmux"
# Stacked changes workflow for Git
brew "git-spice"
# UNIX shell (command interpreter)
brew "zsh"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Prompt: Starship (optional via profile)
brew "starship"
# Nerd Font for better glyphs in terminal prompt
cask "font-jetbrains-mono-nerd-font"

# Developer CLIs
brew "fzf"
brew "ripgrep"
brew "fd"
brew "eza"
brew "bat"
brew "tree"
brew "gnu-sed"
brew "gnu-tar"

# GPG pinentry for macOS dialogs
brew "pinentry-mac"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"

# 1Password (app) + CLI for secret management and future automation
cask "1password"
cask "1password-cli"
# Tap for git-spice
tap "abhinav/tap"
vscode "golang.go"
vscode "ms-vscode.makefile-tools"
# Terminal emulator
cask "iterm2"
